[
  {
    "commentId": 8136707825,
    "productId": 49,
    "userId": 3,
    "date": "2018-06-07",
    "ratingScore": 3,
    "commentText": "Elit minim sit sit dolor ea et. Sint ipsum adipisicing ex eu occaecat eiusmod ad incididunt."
  },
  {
    "commentId": 4970961053,
    "productId": 2,
    "userId": 1,
    "date": "2020-11-26",
    "ratingScore": 1,
    "commentText": "Est proident reprehenderit culpa deserunt commodo esse labore elit. Dolor quis aute laborum laboris voluptate nostrud adipisicing anim officia anim aute minim."
  },
  {
    "commentId": 7909329114,
    "productId": 11,
    "userId": 3,
    "date": "2020-12-08",
    "ratingScore": 2,
    "commentText": "Anim magna eu in tempor est sunt deserunt exercitation duis nulla reprehenderit consectetur reprehenderit minim. Ad id sit nisi in et non laborum."
  },
  {
    "commentId": 1154319455,
    "productId": 92,
    "userId": 3,
    "date": "2021-07-07",
    "ratingScore": 1,
    "commentText": "Duis et aliqua cupidatat ipsum ipsum est minim elit fugiat. Lorem esse cupidatat quis occaecat minim mollit ut magna."
  },
  {
    "commentId": 4109935572,
    "productId": 10,
    "userId": 3,
    "date": "2020-03-20",
    "ratingScore": 5,
    "commentText": "Lorem et pariatur sint cupidatat minim et eiusmod in ad. Ea ut reprehenderit proident nostrud ipsum dolore laboris magna dolore incididunt do ipsum."
  },
  {
    "commentId": 7640420012,
    "productId": 19,
    "userId": 3,
    "date": "2018-02-26",
    "ratingScore": 5,
    "commentText": "Est Lorem occaecat officia officia ad. Mollit qui nisi enim incididunt laborum eiusmod commodo non occaecat et excepteur aute aute id."
  },
  {
    "commentId": 4050618151,
    "productId": 11,
    "userId": 1,
    "date": "2019-04-12",
    "ratingScore": 3,
    "commentText": "Ullamco cillum ea eu velit officia id. Nisi veniam velit consectetur enim."
  },
  {
    "commentId": 3708062504,
    "productId": 41,
    "userId": 3,
    "date": "2020-12-27",
    "ratingScore": 3,
    "commentText": "Voluptate quis aliqua veniam tempor. Do amet elit veniam id eu tempor."
  },
  {
    "commentId": 4152470884,
    "productId": 84,
    "userId": 2,
    "date": "2019-05-09",
    "ratingScore": 2,
    "commentText": "Dolor adipisicing ut occaecat deserunt labore do exercitation in ullamco. Cillum tempor fugiat ullamco labore voluptate sunt veniam Lorem laborum ipsum aliqua."
  },
  {
    "commentId": 4133543117,
    "productId": 97,
    "userId": 3,
    "date": "2019-09-19",
    "ratingScore": 2,
    "commentText": "Ipsum sit adipisicing nisi ullamco est culpa consequat labore incididunt quis. Commodo fugiat cillum elit velit cupidatat culpa qui id qui cupidatat quis pariatur ex."
  },
  {
    "commentId": 8825522338,
    "productId": 63,
    "userId": 2,
    "date": "2019-04-07",
    "ratingScore": 5,
    "commentText": "Eiusmod mollit eiusmod officia sunt. Ad elit eiusmod incididunt et."
  },
  {
    "commentId": 1859694092,
    "productId": 93,
    "userId": 2,
    "date": "2018-02-06",
    "ratingScore": 1,
    "commentText": "Consectetur nisi deserunt minim incididunt aliquip ut consequat magna dolore aliqua tempor non. Ad nostrud irure ullamco adipisicing adipisicing."
  },
  {
    "commentId": 8308329485,
    "productId": 50,
    "userId": 2,
    "date": "2020-12-11",
    "ratingScore": 4,
    "commentText": "Qui deserunt dolor deserunt duis magna ex in incididunt voluptate laboris id excepteur laboris. Occaecat sint occaecat labore commodo laborum deserunt deserunt est nisi deserunt exercitation."
  },
  {
    "commentId": 1647781718,
    "productId": 68,
    "userId": 2,
    "date": "2019-12-25",
    "ratingScore": 3,
    "commentText": "Sunt id non duis consectetur aliquip nostrud dolore. Pariatur duis proident deserunt ad laboris incididunt minim irure culpa."
  },
  {
    "commentId": 4804359222,
    "productId": 96,
    "userId": 2,
    "date": "2021-05-24",
    "ratingScore": 5,
    "commentText": "Officia nulla reprehenderit ea duis mollit consectetur anim ipsum consectetur. Cillum irure voluptate esse amet in."
  },
  {
    "commentId": 9547449523,
    "productId": 69,
    "userId": 2,
    "date": "2021-05-17",
    "ratingScore": 3,
    "commentText": "Reprehenderit laboris magna dolor enim voluptate aliquip irure enim anim mollit Lorem. Reprehenderit elit tempor excepteur exercitation ea eiusmod do tempor."
  },
  {
    "commentId": 7718548863,
    "productId": 6,
    "userId": 1,
    "date": "2019-07-10",
    "ratingScore": 5,
    "commentText": "Consequat elit et dolore magna laborum in ad. Elit officia et commodo ad enim cillum sint."
  },
  {
    "commentId": 8253716920,
    "productId": 69,
    "userId": 3,
    "date": "2021-06-15",
    "ratingScore": 1,
    "commentText": "Reprehenderit commodo pariatur deserunt nostrud fugiat laboris fugiat ut. Ex cupidatat incididunt deserunt tempor et irure veniam dolor."
  },
  {
    "commentId": 7007951924,
    "productId": 25,
    "userId": 3,
    "date": "2018-02-05",
    "ratingScore": 4,
    "commentText": "Commodo eu mollit laboris elit. Lorem fugiat consectetur enim eu pariatur aliqua reprehenderit ullamco incididunt amet velit magna."
  },
  {
    "commentId": 8974803602,
    "productId": 92,
    "userId": 2,
    "date": "2018-12-26",
    "ratingScore": 5,
    "commentText": "Fugiat Lorem commodo sit id enim laboris consectetur qui. Aliqua labore occaecat ex enim eu qui irure labore nostrud consectetur cillum."
  },
  {
    "commentId": 3649678588,
    "productId": 11,
    "userId": 2,
    "date": "2019-11-28",
    "ratingScore": 3,
    "commentText": "Elit excepteur commodo ad ad qui cillum proident occaecat eiusmod esse cupidatat. Qui aliqua ex et velit occaecat labore Lorem excepteur consequat ad."
  },
  {
    "commentId": 2973844145,
    "productId": 39,
    "userId": 3,
    "date": "2021-03-03",
    "ratingScore": 4,
    "commentText": "Excepteur aliqua enim ut enim minim anim deserunt. Reprehenderit veniam irure commodo sint cupidatat eu pariatur irure adipisicing eiusmod sint."
  },
  {
    "commentId": 6642717809,
    "productId": 59,
    "userId": 3,
    "date": "2020-10-11",
    "ratingScore": 4,
    "commentText": "Anim aute laboris sint aliqua enim velit quis ea proident eu. Ea Lorem minim commodo proident ullamco voluptate elit."
  },
  {
    "commentId": 9689414545,
    "productId": 73,
    "userId": 2,
    "date": "2019-03-14",
    "ratingScore": 1,
    "commentText": "Ullamco adipisicing do nulla velit excepteur proident consequat ut cupidatat ut dolor ullamco ex. Consectetur in irure incididunt reprehenderit."
  },
  {
    "commentId": 2451371688,
    "productId": 98,
    "userId": 3,
    "date": "2018-11-17",
    "ratingScore": 5,
    "commentText": "Ex incididunt nostrud ut enim minim Lorem. Nulla irure cupidatat adipisicing consequat ut aliquip excepteur aliquip velit excepteur minim nulla veniam."
  },
  {
    "commentId": 5973007294,
    "productId": 100,
    "userId": 3,
    "date": "2018-05-26",
    "ratingScore": 4,
    "commentText": "Deserunt voluptate officia proident aliqua aliqua laboris excepteur consectetur est. Ullamco et ea esse fugiat labore incididunt do amet ex irure."
  },
  {
    "commentId": 1010083919,
    "productId": 34,
    "userId": 2,
    "date": "2019-07-06",
    "ratingScore": 1,
    "commentText": "Consequat pariatur veniam mollit laboris quis tempor excepteur irure nostrud adipisicing enim. Mollit reprehenderit laboris id amet sit irure non eiusmod esse ut incididunt."
  },
  {
    "commentId": 3263995941,
    "productId": 71,
    "userId": 1,
    "date": "2018-07-04",
    "ratingScore": 4,
    "commentText": "Cillum ad ea mollit nisi velit occaecat consectetur nisi tempor. Eu nostrud tempor consectetur est est duis."
  },
  {
    "commentId": 2475567995,
    "productId": 44,
    "userId": 2,
    "date": "2018-08-01",
    "ratingScore": 4,
    "commentText": "Id magna ea aliqua qui cillum officia ad adipisicing. Sunt magna ea aliquip consectetur labore aliquip."
  },
  {
    "commentId": 5393771514,
    "productId": 27,
    "userId": 1,
    "date": "2018-11-17",
    "ratingScore": 4,
    "commentText": "Excepteur veniam laborum culpa dolor ullamco minim. Magna officia eiusmod velit ea proident dolore."
  },
  {
    "commentId": 1309571474,
    "productId": 53,
    "userId": 2,
    "date": "2020-09-29",
    "ratingScore": 4,
    "commentText": "Sunt aliquip exercitation commodo do id labore non. Consectetur velit tempor veniam esse dolor amet qui."
  },
  {
    "commentId": 9698040308,
    "productId": 17,
    "userId": 1,
    "date": "2018-11-22",
    "ratingScore": 1,
    "commentText": "Laboris fugiat nostrud consequat ipsum eiusmod occaecat qui. Mollit enim voluptate eu reprehenderit duis cupidatat sit cillum reprehenderit sit."
  },
  {
    "commentId": 5903714845,
    "productId": 55,
    "userId": 2,
    "date": "2021-06-27",
    "ratingScore": 2,
    "commentText": "Eu do consectetur voluptate velit officia nostrud labore pariatur id occaecat esse incididunt. Ad minim qui velit dolor consectetur irure excepteur."
  },
  {
    "commentId": 8786710520,
    "productId": 74,
    "userId": 1,
    "date": "2019-11-21",
    "ratingScore": 3,
    "commentText": "Consequat mollit velit duis mollit. Ipsum do do ea eiusmod velit magna amet officia deserunt sint labore nostrud irure."
  },
  {
    "commentId": 5008560595,
    "productId": 32,
    "userId": 1,
    "date": "2020-07-01",
    "ratingScore": 4,
    "commentText": "Nostrud voluptate laboris reprehenderit cillum. Qui consequat quis nisi enim tempor nostrud minim mollit cupidatat aute et fugiat."
  },
  {
    "commentId": 7921853255,
    "productId": 26,
    "userId": 2,
    "date": "2018-02-20",
    "ratingScore": 2,
    "commentText": "Esse mollit minim nostrud esse occaecat esse nostrud Lorem excepteur culpa nulla amet ad. Aliquip do ex officia dolor proident Lorem officia."
  },
  {
    "commentId": 7838768908,
    "productId": 12,
    "userId": 3,
    "date": "2021-03-14",
    "ratingScore": 3,
    "commentText": "Consequat cupidatat consectetur dolore commodo sit id velit enim aliqua. Anim sit tempor et in proident pariatur."
  },
  {
    "commentId": 7603127298,
    "productId": 65,
    "userId": 2,
    "date": "2021-05-27",
    "ratingScore": 1,
    "commentText": "Deserunt qui enim elit proident. Esse sunt deserunt ut esse est ut."
  },
  {
    "commentId": 7936284072,
    "productId": 4,
    "userId": 3,
    "date": "2018-10-26",
    "ratingScore": 3,
    "commentText": "Esse et incididunt amet fugiat duis mollit. Consequat mollit quis consequat enim laboris minim laboris."
  },
  {
    "commentId": 6455151429,
    "productId": 74,
    "userId": 1,
    "date": "2019-08-22",
    "ratingScore": 4,
    "commentText": "Reprehenderit id elit eu Lorem exercitation duis ea occaecat. In adipisicing laboris magna enim anim ullamco consequat."
  },
  {
    "commentId": 6798575833,
    "productId": 89,
    "userId": 1,
    "date": "2018-11-07",
    "ratingScore": 5,
    "commentText": "Eiusmod officia voluptate exercitation ad qui deserunt. Aliquip ad cupidatat excepteur labore tempor."
  },
  {
    "commentId": 3596934289,
    "productId": 54,
    "userId": 1,
    "date": "2020-10-31",
    "ratingScore": 4,
    "commentText": "Cillum amet ex ex qui aliqua do voluptate eiusmod eiusmod esse qui nostrud eiusmod culpa. Pariatur exercitation culpa eu labore officia dolor aliqua labore est minim sit."
  },
  {
    "commentId": 6721466084,
    "productId": 61,
    "userId": 3,
    "date": "2019-05-17",
    "ratingScore": 3,
    "commentText": "Cupidatat qui nisi consectetur mollit occaecat anim dolor. Non amet cillum fugiat dolore."
  },
  {
    "commentId": 3614335666,
    "productId": 35,
    "userId": 2,
    "date": "2021-07-13",
    "ratingScore": 4,
    "commentText": "Nostrud eu cupidatat veniam est sunt enim eiusmod elit. Incididunt proident aliqua laborum eiusmod eu commodo Lorem."
  },
  {
    "commentId": 6213061158,
    "productId": 20,
    "userId": 2,
    "date": "2019-11-04",
    "ratingScore": 4,
    "commentText": "Incididunt proident velit est velit in id occaecat mollit esse labore laboris voluptate consectetur do. Ut ut ut aliqua pariatur."
  },
  {
    "commentId": 4866196856,
    "productId": 99,
    "userId": 2,
    "date": "2018-10-07",
    "ratingScore": 4,
    "commentText": "Et excepteur nisi enim consectetur laboris excepteur mollit duis. Proident nulla eiusmod ex consectetur consequat cupidatat occaecat veniam nulla pariatur aliqua qui exercitation."
  },
  {
    "commentId": 1072844126,
    "productId": 76,
    "userId": 3,
    "date": "2020-10-29",
    "ratingScore": 2,
    "commentText": "Anim magna do anim quis incididunt mollit aliquip ut incididunt cillum. In commodo exercitation irure consectetur sit do cupidatat eu qui in commodo."
  },
  {
    "commentId": 3592006231,
    "productId": 3,
    "userId": 1,
    "date": "2019-02-21",
    "ratingScore": 4,
    "commentText": "Dolore proident irure mollit aute ut id eu aliqua. Incididunt pariatur cupidatat deserunt excepteur excepteur aute qui eiusmod veniam nostrud nostrud officia dolore velit."
  },
  {
    "commentId": 8767218556,
    "productId": 97,
    "userId": 3,
    "date": "2020-11-17",
    "ratingScore": 5,
    "commentText": "Ut adipisicing Lorem qui duis reprehenderit qui id ullamco duis sint. Dolore incididunt veniam sint irure reprehenderit sint irure consequat eiusmod laboris Lorem est."
  },
  {
    "commentId": 8561614087,
    "productId": 78,
    "userId": 3,
    "date": "2020-01-16",
    "ratingScore": 1,
    "commentText": "Eu eiusmod laboris eiusmod minim minim occaecat mollit cupidatat laborum velit amet tempor dolore. Exercitation esse ex consectetur aliqua dolor commodo pariatur eu fugiat do anim laborum."
  },
  {
    "commentId": 7546252111,
    "productId": 63,
    "userId": 3,
    "date": "2020-08-04",
    "ratingScore": 5,
    "commentText": "Minim deserunt aute consectetur magna aliqua in. Nisi commodo aliquip consectetur tempor do labore ex nostrud amet."
  },
  {
    "commentId": 6034242543,
    "productId": 81,
    "userId": 3,
    "date": "2018-08-11",
    "ratingScore": 1,
    "commentText": "Nisi cupidatat occaecat aliquip aute aute minim esse duis cupidatat nostrud non enim mollit ullamco. Anim commodo ut excepteur cillum adipisicing commodo id dolor laboris sunt minim magna."
  },
  {
    "commentId": 8177255265,
    "productId": 91,
    "userId": 1,
    "date": "2020-06-10",
    "ratingScore": 2,
    "commentText": "Esse est ipsum in fugiat. Sint veniam commodo non magna."
  },
  {
    "commentId": 4696884921,
    "productId": 100,
    "userId": 3,
    "date": "2020-12-16",
    "ratingScore": 3,
    "commentText": "Occaecat duis in cupidatat nulla pariatur minim. Aliquip officia qui consectetur duis do cupidatat aute consequat sunt."
  },
  {
    "commentId": 7584501737,
    "productId": 94,
    "userId": 2,
    "date": "2018-09-29",
    "ratingScore": 4,
    "commentText": "Sit laboris incididunt aliqua commodo enim consectetur veniam velit consectetur consequat veniam ipsum ad in. Pariatur qui labore eiusmod aute culpa sunt ea excepteur irure mollit nisi aliqua Lorem pariatur."
  },
  {
    "commentId": 8646120138,
    "productId": 57,
    "userId": 3,
    "date": "2018-07-24",
    "ratingScore": 1,
    "commentText": "Excepteur excepteur mollit adipisicing consequat dolor cupidatat pariatur sit exercitation. Ipsum cupidatat duis ullamco magna Lorem commodo."
  },
  {
    "commentId": 5515682594,
    "productId": 51,
    "userId": 2,
    "date": "2020-04-15",
    "ratingScore": 1,
    "commentText": "Eu velit veniam consequat nostrud cupidatat consectetur mollit quis. Magna minim elit laboris Lorem et deserunt labore eu minim eiusmod labore."
  },
  {
    "commentId": 2154704922,
    "productId": 71,
    "userId": 2,
    "date": "2019-04-13",
    "ratingScore": 4,
    "commentText": "Lorem laborum sit qui nostrud aute non eu consequat sint ipsum esse do ea officia. Proident proident labore irure ad elit ad voluptate ipsum."
  },
  {
    "commentId": 5442107249,
    "productId": 59,
    "userId": 2,
    "date": "2020-09-05",
    "ratingScore": 2,
    "commentText": "Adipisicing cupidatat ex ad adipisicing consequat nisi. Mollit non pariatur laborum amet ad qui id."
  },
  {
    "commentId": 7558901634,
    "productId": 2,
    "userId": 3,
    "date": "2020-11-28",
    "ratingScore": 3,
    "commentText": "Nisi culpa cillum incididunt incididunt veniam veniam consequat. Officia eu cupidatat nisi consectetur minim mollit culpa."
  },
  {
    "commentId": 5196575581,
    "productId": 94,
    "userId": 1,
    "date": "2021-07-21",
    "ratingScore": 2,
    "commentText": "Esse adipisicing adipisicing proident non sit officia. In exercitation enim eiusmod amet commodo tempor consequat irure magna nostrud est reprehenderit."
  },
  {
    "commentId": 3989407698,
    "productId": 23,
    "userId": 2,
    "date": "2020-07-31",
    "ratingScore": 1,
    "commentText": "Qui consectetur sint sint consequat. Esse consequat consectetur magna tempor proident minim aliquip elit cupidatat reprehenderit."
  },
  {
    "commentId": 3564038018,
    "productId": 78,
    "userId": 3,
    "date": "2020-07-16",
    "ratingScore": 3,
    "commentText": "Do laboris labore fugiat voluptate in amet proident voluptate mollit fugiat. In laboris ad Lorem anim."
  },
  {
    "commentId": 7823955455,
    "productId": 49,
    "userId": 2,
    "date": "2018-12-09",
    "ratingScore": 3,
    "commentText": "Amet commodo do ullamco amet ullamco esse est quis officia. Qui irure adipisicing sit id minim consectetur anim consectetur."
  },
  {
    "commentId": 9387737313,
    "productId": 42,
    "userId": 1,
    "date": "2019-08-20",
    "ratingScore": 4,
    "commentText": "Nulla laborum ea ea magna. Consectetur aute non veniam reprehenderit ea enim officia laboris."
  },
  {
    "commentId": 9980253227,
    "productId": 98,
    "userId": 1,
    "date": "2019-12-26",
    "ratingScore": 4,
    "commentText": "Consequat in duis laborum esse aute ut eu labore ea commodo proident eiusmod. Laborum nostrud pariatur ex reprehenderit consequat consequat eu officia aliqua exercitation quis cillum id."
  },
  {
    "commentId": 7714654773,
    "productId": 52,
    "userId": 2,
    "date": "2021-01-01",
    "ratingScore": 5,
    "commentText": "Consequat ex ex aute culpa. Amet aute ex ea laboris Lorem fugiat ex tempor fugiat occaecat."
  },
  {
    "commentId": 5451041884,
    "productId": 44,
    "userId": 3,
    "date": "2019-03-30",
    "ratingScore": 5,
    "commentText": "Incididunt non consequat laborum dolore fugiat aliquip aliqua dolore duis deserunt eiusmod quis dolore. Ea deserunt nostrud laboris tempor minim non non occaecat."
  },
  {
    "commentId": 1428127774,
    "productId": 55,
    "userId": 3,
    "date": "2018-12-29",
    "ratingScore": 3,
    "commentText": "Sunt ullamco excepteur culpa officia anim irure sint est non. Eu in velit est ullamco commodo ad."
  },
  {
    "commentId": 5023728002,
    "productId": 93,
    "userId": 3,
    "date": "2018-10-17",
    "ratingScore": 3,
    "commentText": "Nostrud aliqua in fugiat cupidatat dolore veniam velit velit minim ea consectetur do proident. Laborum ut sunt culpa adipisicing tempor laboris aliqua."
  },
  {
    "commentId": 8476650423,
    "productId": 77,
    "userId": 1,
    "date": "2019-08-18",
    "ratingScore": 4,
    "commentText": "Incididunt quis velit eu duis cupidatat nostrud ullamco laboris sint laboris adipisicing mollit eiusmod sit. Esse ullamco sint reprehenderit Lorem nostrud cillum do ea pariatur dolor."
  },
  {
    "commentId": 7917192065,
    "productId": 19,
    "userId": 1,
    "date": "2020-07-03",
    "ratingScore": 4,
    "commentText": "Ipsum minim duis dolor anim labore id duis reprehenderit quis est officia consectetur exercitation eiusmod. Anim cillum duis adipisicing laboris dolore aliqua qui."
  },
  {
    "commentId": 1609690617,
    "productId": 38,
    "userId": 1,
    "date": "2018-03-06",
    "ratingScore": 5,
    "commentText": "Qui tempor labore adipisicing voluptate aliquip esse aute esse consequat eu officia. Commodo consectetur anim magna fugiat velit consequat veniam fugiat fugiat minim consectetur."
  },
  {
    "commentId": 3387056376,
    "productId": 80,
    "userId": 2,
    "date": "2018-12-27",
    "ratingScore": 1,
    "commentText": "Sit tempor fugiat exercitation fugiat fugiat duis commodo irure aute deserunt excepteur nisi. Tempor ea excepteur aliqua eiusmod pariatur qui eu sit do Lorem officia culpa cillum."
  },
  {
    "commentId": 7675141366,
    "productId": 24,
    "userId": 1,
    "date": "2018-07-18",
    "ratingScore": 3,
    "commentText": "In amet labore esse labore sint voluptate est esse velit nostrud proident. Fugiat consectetur et irure magna quis ipsum nostrud cillum consequat enim."
  },
  {
    "commentId": 3831116820,
    "productId": 71,
    "userId": 1,
    "date": "2019-12-12",
    "ratingScore": 1,
    "commentText": "Quis exercitation incididunt aliquip Lorem enim et irure. Duis laborum irure laboris veniam ut laborum amet do esse dolor dolore dolore ullamco."
  },
  {
    "commentId": 2781253527,
    "productId": 93,
    "userId": 3,
    "date": "2019-09-12",
    "ratingScore": 5,
    "commentText": "Nisi ad non culpa occaecat. Veniam dolore dolore culpa fugiat cillum est Lorem non aute ipsum ut exercitation ad."
  },
  {
    "commentId": 5814916010,
    "productId": 85,
    "userId": 2,
    "date": "2018-07-26",
    "ratingScore": 2,
    "commentText": "Do officia consequat ex est velit esse excepteur. Id quis in quis veniam amet excepteur labore."
  },
  {
    "commentId": 4215014529,
    "productId": 51,
    "userId": 1,
    "date": "2018-07-04",
    "ratingScore": 3,
    "commentText": "Aliqua ipsum occaecat quis dolor deserunt consectetur eu. In ex qui amet ea exercitation velit anim quis."
  },
  {
    "commentId": 6834901507,
    "productId": 33,
    "userId": 2,
    "date": "2020-03-10",
    "ratingScore": 5,
    "commentText": "Eiusmod anim culpa mollit ipsum eu laborum irure culpa do exercitation et mollit. Est fugiat nostrud ex laborum ullamco et sunt sint exercitation duis aliqua."
  },
  {
    "commentId": 4771871625,
    "productId": 18,
    "userId": 1,
    "date": "2018-08-07",
    "ratingScore": 1,
    "commentText": "Reprehenderit tempor minim consequat esse laboris dolor enim in cupidatat ut. Adipisicing commodo ex elit voluptate enim magna in ullamco est sunt adipisicing culpa velit anim."
  },
  {
    "commentId": 1531708115,
    "productId": 47,
    "userId": 2,
    "date": "2019-09-28",
    "ratingScore": 5,
    "commentText": "Ipsum enim ut officia nisi ullamco quis minim ipsum reprehenderit incididunt labore ea ut. Do voluptate ullamco adipisicing incididunt veniam ut eu sit ut irure ullamco."
  },
  {
    "commentId": 3204749493,
    "productId": 13,
    "userId": 1,
    "date": "2020-06-28",
    "ratingScore": 2,
    "commentText": "Voluptate tempor Lorem do laboris id elit laboris consequat non minim id cupidatat nulla elit. Aliqua voluptate culpa commodo adipisicing aute occaecat velit laborum occaecat."
  },
  {
    "commentId": 8295188941,
    "productId": 7,
    "userId": 3,
    "date": "2020-04-16",
    "ratingScore": 3,
    "commentText": "Tempor qui dolore qui commodo ut ut est minim culpa esse. Elit esse ipsum est sunt voluptate est do nulla sint est."
  },
  {
    "commentId": 9079012464,
    "productId": 73,
    "userId": 2,
    "date": "2020-07-16",
    "ratingScore": 1,
    "commentText": "Commodo non aliqua consequat minim ut eiusmod. Minim laborum aliquip ut dolor laboris deserunt consequat et officia."
  },
  {
    "commentId": 9362786864,
    "productId": 33,
    "userId": 1,
    "date": "2020-09-30",
    "ratingScore": 2,
    "commentText": "Voluptate dolor ipsum fugiat culpa ut consequat enim mollit dolore officia. Eiusmod aliqua ullamco Lorem veniam esse dolor laborum et et."
  },
  {
    "commentId": 6253730319,
    "productId": 90,
    "userId": 2,
    "date": "2018-06-12",
    "ratingScore": 2,
    "commentText": "Aliqua minim sint quis voluptate consequat dolor mollit est nulla minim. Amet Lorem voluptate consequat amet in sunt nisi ipsum deserunt consectetur anim qui."
  },
  {
    "commentId": 5391800475,
    "productId": 97,
    "userId": 2,
    "date": "2021-04-02",
    "ratingScore": 1,
    "commentText": "Consequat eu qui aliqua sit. Ipsum dolore nisi consequat dolor ea culpa ipsum anim sint eu."
  },
  {
    "commentId": 2418317364,
    "productId": 82,
    "userId": 3,
    "date": "2018-10-29",
    "ratingScore": 5,
    "commentText": "Reprehenderit aliqua eu ut voluptate cillum reprehenderit veniam. Do ipsum do in eiusmod commodo."
  },
  {
    "commentId": 8858053447,
    "productId": 34,
    "userId": 1,
    "date": "2018-07-05",
    "ratingScore": 5,
    "commentText": "Ut cupidatat eiusmod proident amet qui. Esse anim duis occaecat enim ex ipsum cupidatat aute mollit labore amet officia aute."
  },
  {
    "commentId": 6881452952,
    "productId": 68,
    "userId": 3,
    "date": "2019-01-19",
    "ratingScore": 3,
    "commentText": "Velit culpa id aliquip enim. Adipisicing reprehenderit cupidatat amet deserunt elit do ea consequat amet officia proident excepteur non."
  },
  {
    "commentId": 7509569462,
    "productId": 62,
    "userId": 1,
    "date": "2019-06-23",
    "ratingScore": 4,
    "commentText": "Eu adipisicing esse enim amet amet laborum culpa. Culpa est consectetur ex occaecat cupidatat sit do."
  },
  {
    "commentId": 7341237152,
    "productId": 23,
    "userId": 3,
    "date": "2019-04-04",
    "ratingScore": 4,
    "commentText": "In sit sunt consectetur in velit. Qui est voluptate sunt deserunt minim culpa deserunt consectetur tempor enim qui."
  },
  {
    "commentId": 2274247415,
    "productId": 6,
    "userId": 1,
    "date": "2021-08-01",
    "ratingScore": 1,
    "commentText": "Deserunt elit adipisicing id ex dolore. Ad occaecat eu deserunt enim deserunt fugiat pariatur est et labore exercitation ad nisi nisi."
  },
  {
    "commentId": 4736963535,
    "productId": 38,
    "userId": 3,
    "date": "2019-09-19",
    "ratingScore": 3,
    "commentText": "Voluptate sunt ex do mollit non dolor velit. Labore Lorem consectetur adipisicing reprehenderit."
  },
  {
    "commentId": 5977863776,
    "productId": 92,
    "userId": 2,
    "date": "2020-06-01",
    "ratingScore": 5,
    "commentText": "Veniam qui minim anim velit qui exercitation do proident. Ullamco ea consequat sit incididunt nisi enim esse proident sint anim."
  },
  {
    "commentId": 5638636178,
    "productId": 44,
    "userId": 1,
    "date": "2020-11-09",
    "ratingScore": 1,
    "commentText": "Laboris labore enim ullamco voluptate aliquip duis enim cillum pariatur laborum dolore duis. Do laborum id mollit veniam consectetur nostrud cillum aliqua cillum labore."
  },
  {
    "commentId": 3366270477,
    "productId": 43,
    "userId": 3,
    "date": "2019-12-10",
    "ratingScore": 2,
    "commentText": "Enim enim duis adipisicing nulla. Id id voluptate incididunt irure pariatur pariatur velit id."
  },
  {
    "commentId": 4179373428,
    "productId": 53,
    "userId": 1,
    "date": "2018-07-22",
    "ratingScore": 3,
    "commentText": "Minim dolor magna eu magna dolore dolore sit Lorem sunt. Tempor exercitation dolor cupidatat do."
  },
  {
    "commentId": 3677726785,
    "productId": 73,
    "userId": 1,
    "date": "2020-11-15",
    "ratingScore": 3,
    "commentText": "In consequat commodo elit ea velit do id excepteur ut irure duis commodo fugiat aute. Enim proident deserunt occaecat sunt proident dolor excepteur."
  },
  {
    "commentId": 7208672952,
    "productId": 9,
    "userId": 3,
    "date": "2021-07-06",
    "ratingScore": 1,
    "commentText": "Qui ut consequat id adipisicing anim quis est excepteur voluptate quis qui esse. Ullamco mollit veniam deserunt Lorem excepteur."
  },
  {
    "commentId": 9033531469,
    "productId": 22,
    "userId": 2,
    "date": "2020-10-29",
    "ratingScore": 2,
    "commentText": "Fugiat nostrud labore duis esse laborum esse ut do culpa esse occaecat. Irure consequat tempor nulla ea magna officia excepteur."
  },
  {
    "commentId": 2226602707,
    "productId": 69,
    "userId": 2,
    "date": "2018-02-24",
    "ratingScore": 3,
    "commentText": "Qui esse anim eiusmod proident sit mollit labore consequat incididunt. Nisi culpa irure consectetur labore non et eu culpa quis sint irure."
  },
  {
    "commentId": 1070758056,
    "productId": 30,
    "userId": 3,
    "date": "2019-10-27",
    "ratingScore": 5,
    "commentText": "Nostrud minim pariatur mollit dolor aute non esse. Sunt eiusmod proident pariatur ad irure excepteur commodo occaecat."
  },
  {
    "commentId": 1225387747,
    "productId": 87,
    "userId": 3,
    "date": "2020-10-01",
    "ratingScore": 3,
    "commentText": "Eiusmod esse et ex magna cupidatat. Exercitation eu culpa nulla incididunt elit ea eiusmod culpa."
  },
  {
    "commentId": 2470773575,
    "productId": 44,
    "userId": 3,
    "date": "2020-06-25",
    "ratingScore": 2,
    "commentText": "Commodo eu eu nostrud ullamco proident minim ad duis amet eu exercitation aliquip reprehenderit consequat. Pariatur eu quis ea elit minim quis."
  },
  {
    "commentId": 1445526179,
    "productId": 80,
    "userId": 1,
    "date": "2021-08-20",
    "ratingScore": 5,
    "commentText": "Mollit consequat fugiat dolor deserunt veniam magna nisi sint. Anim nulla in amet aliquip est sunt velit deserunt velit dolor eiusmod."
  },
  {
    "commentId": 3155447111,
    "productId": 80,
    "userId": 2,
    "date": "2021-06-23",
    "ratingScore": 1,
    "commentText": "Minim aliquip nisi nulla elit velit veniam nisi esse sit amet laborum. Irure eu nisi culpa officia minim esse."
  },
  {
    "commentId": 6316190171,
    "productId": 22,
    "userId": 3,
    "date": "2020-08-03",
    "ratingScore": 5,
    "commentText": "Enim eiusmod sit aliquip exercitation anim cupidatat proident amet dolor quis. Dolore voluptate duis nostrud fugiat proident aliquip magna culpa consequat est."
  },
  {
    "commentId": 1950098862,
    "productId": 35,
    "userId": 3,
    "date": "2018-04-30",
    "ratingScore": 3,
    "commentText": "Lorem elit ad amet eiusmod culpa ut. Dolor elit ipsum esse pariatur sint nulla nulla."
  },
  {
    "commentId": 4456083613,
    "productId": 11,
    "userId": 3,
    "date": "2019-02-12",
    "ratingScore": 2,
    "commentText": "In commodo fugiat exercitation reprehenderit magna officia velit esse officia elit eiusmod enim velit nostrud. Laborum quis consectetur adipisicing proident Lorem."
  },
  {
    "commentId": 1978415448,
    "productId": 80,
    "userId": 2,
    "date": "2020-04-22",
    "ratingScore": 3,
    "commentText": "Labore duis minim nulla consectetur elit mollit pariatur deserunt magna culpa. Ut id eu mollit laboris anim aliqua."
  },
  {
    "commentId": 9712744976,
    "productId": 8,
    "userId": 1,
    "date": "2018-06-17",
    "ratingScore": 5,
    "commentText": "Ipsum duis cillum incididunt velit ut ea excepteur mollit cupidatat minim qui occaecat amet ut. Exercitation proident eiusmod id dolor Lorem in."
  },
  {
    "commentId": 5976960666,
    "productId": 73,
    "userId": 2,
    "date": "2020-04-22",
    "ratingScore": 3,
    "commentText": "Consequat Lorem eiusmod do veniam tempor officia. Excepteur proident amet adipisicing anim."
  },
  {
    "commentId": 3474736458,
    "productId": 30,
    "userId": 3,
    "date": "2021-03-23",
    "ratingScore": 2,
    "commentText": "Mollit id aliquip qui ea consectetur eiusmod enim anim cupidatat fugiat eiusmod dolor. Elit irure pariatur amet eiusmod exercitation tempor minim reprehenderit consectetur ex amet."
  },
  {
    "commentId": 4349910771,
    "productId": 57,
    "userId": 1,
    "date": "2019-06-22",
    "ratingScore": 2,
    "commentText": "Esse officia cillum dolore minim in minim elit fugiat ex do deserunt. Anim aliquip aliquip consequat in nostrud."
  },
  {
    "commentId": 8332165864,
    "productId": 80,
    "userId": 3,
    "date": "2021-03-17",
    "ratingScore": 5,
    "commentText": "Incididunt ad in nostrud ex ipsum commodo dolor ex Lorem dolore sit consectetur fugiat nulla. Veniam proident nisi dolor aute voluptate proident exercitation adipisicing adipisicing ad aute."
  },
  {
    "commentId": 7999259693,
    "productId": 74,
    "userId": 3,
    "date": "2019-01-06",
    "ratingScore": 2,
    "commentText": "Dolor tempor et nisi cillum cupidatat do consequat fugiat exercitation elit occaecat in veniam duis. Consequat velit amet commodo deserunt aliqua minim eiusmod ex eu magna laborum labore esse laboris."
  },
  {
    "commentId": 4378586934,
    "productId": 30,
    "userId": 2,
    "date": "2018-09-11",
    "ratingScore": 2,
    "commentText": "Culpa aute sunt Lorem amet nostrud laborum exercitation cupidatat excepteur ullamco cupidatat esse dolor. Elit exercitation consectetur do amet sit fugiat laboris laborum adipisicing voluptate sit sunt anim."
  },
  {
    "commentId": 5208167631,
    "productId": 97,
    "userId": 2,
    "date": "2018-04-17",
    "ratingScore": 3,
    "commentText": "Nisi non non adipisicing amet officia nulla. Eiusmod nisi consectetur qui Lorem quis."
  },
  {
    "commentId": 4661452576,
    "productId": 24,
    "userId": 3,
    "date": "2019-12-11",
    "ratingScore": 1,
    "commentText": "Consequat cupidatat officia amet qui. Non dolor dolore eu magna pariatur."
  },
  {
    "commentId": 3441551727,
    "productId": 41,
    "userId": 2,
    "date": "2019-03-25",
    "ratingScore": 3,
    "commentText": "Veniam laborum minim id officia dolore sunt aute Lorem id. Minim aute sunt eiusmod culpa ex ea cillum sunt ea in ad minim."
  },
  {
    "commentId": 8946133554,
    "productId": 92,
    "userId": 3,
    "date": "2018-02-19",
    "ratingScore": 5,
    "commentText": "Voluptate tempor labore in reprehenderit ut aliquip consectetur et nulla sint nulla. Ut minim nulla dolore amet deserunt eiusmod non proident."
  },
  {
    "commentId": 8982930600,
    "productId": 76,
    "userId": 1,
    "date": "2021-05-06",
    "ratingScore": 3,
    "commentText": "Ullamco non ad mollit excepteur ad consequat elit ex sint. Lorem labore veniam duis officia quis."
  },
  {
    "commentId": 8694707043,
    "productId": 56,
    "userId": 1,
    "date": "2018-04-30",
    "ratingScore": 5,
    "commentText": "Sint duis dolor commodo aliquip ut pariatur voluptate. Qui nulla ullamco incididunt veniam reprehenderit aliquip adipisicing commodo aute non amet ex labore incididunt."
  },
  {
    "commentId": 3252780228,
    "productId": 63,
    "userId": 3,
    "date": "2021-04-19",
    "ratingScore": 2,
    "commentText": "Sint esse consequat aliqua reprehenderit in minim laborum sint adipisicing mollit veniam quis. Incididunt tempor ut nostrud veniam veniam."
  },
  {
    "commentId": 1958294377,
    "productId": 77,
    "userId": 1,
    "date": "2021-03-08",
    "ratingScore": 1,
    "commentText": "Laborum incididunt do fugiat esse magna magna ad magna. Aliquip exercitation id consectetur velit."
  },
  {
    "commentId": 3461291106,
    "productId": 23,
    "userId": 1,
    "date": "2019-07-13",
    "ratingScore": 2,
    "commentText": "Pariatur nulla commodo minim culpa consectetur. Veniam eu esse duis irure labore pariatur fugiat in Lorem deserunt adipisicing exercitation."
  },
  {
    "commentId": 6416076939,
    "productId": 56,
    "userId": 2,
    "date": "2019-05-14",
    "ratingScore": 2,
    "commentText": "Magna nulla anim cupidatat in esse officia aliquip exercitation nisi ut velit elit consequat. Ipsum est ipsum adipisicing tempor magna excepteur est ea amet sint ullamco amet."
  },
  {
    "commentId": 8409510335,
    "productId": 35,
    "userId": 3,
    "date": "2020-04-10",
    "ratingScore": 3,
    "commentText": "Quis ullamco do aute qui duis duis. Id eiusmod amet voluptate et incididunt esse id magna velit voluptate dolor Lorem ut."
  },
  {
    "commentId": 4243703930,
    "productId": 81,
    "userId": 3,
    "date": "2020-02-28",
    "ratingScore": 1,
    "commentText": "Ad mollit voluptate ex incididunt pariatur sit sit. Dolore irure velit elit anim est nisi sit laborum."
  },
  {
    "commentId": 6347319366,
    "productId": 3,
    "userId": 2,
    "date": "2018-03-17",
    "ratingScore": 1,
    "commentText": "Laboris excepteur elit sint laborum aute laborum. Irure cillum tempor id Lorem anim officia."
  },
  {
    "commentId": 1936131494,
    "productId": 52,
    "userId": 2,
    "date": "2021-03-25",
    "ratingScore": 5,
    "commentText": "Incididunt sint labore ex dolore exercitation Lorem ex. Fugiat esse voluptate ex exercitation veniam non elit voluptate culpa consequat occaecat ipsum eiusmod."
  },
  {
    "commentId": 8571825681,
    "productId": 9,
    "userId": 3,
    "date": "2020-10-29",
    "ratingScore": 5,
    "commentText": "Magna ea eiusmod dolor labore id sit fugiat est labore cillum cillum consectetur eu consectetur. Consectetur sint nostrud dolor dolore dolor laborum duis sint id ea."
  },
  {
    "commentId": 1373075149,
    "productId": 89,
    "userId": 2,
    "date": "2020-03-08",
    "ratingScore": 2,
    "commentText": "Dolor minim quis laboris deserunt pariatur duis officia ex anim. Proident fugiat nulla excepteur sint deserunt est aliquip commodo excepteur aute sunt."
  },
  {
    "commentId": 8788693088,
    "productId": 86,
    "userId": 2,
    "date": "2020-12-01",
    "ratingScore": 3,
    "commentText": "Ullamco commodo consequat voluptate cillum ad cillum anim pariatur consectetur esse pariatur quis dolore nulla. Reprehenderit nisi id velit excepteur excepteur laborum veniam velit."
  },
  {
    "commentId": 3817364841,
    "productId": 37,
    "userId": 2,
    "date": "2018-12-07",
    "ratingScore": 1,
    "commentText": "Pariatur in do cupidatat in exercitation sit incididunt fugiat duis ad excepteur nisi. Incididunt do cillum enim laboris incididunt commodo adipisicing dolor amet id excepteur cupidatat dolor eiusmod."
  },
  {
    "commentId": 5081321639,
    "productId": 7,
    "userId": 2,
    "date": "2021-01-09",
    "ratingScore": 5,
    "commentText": "Anim ex anim sit irure excepteur eiusmod culpa esse anim voluptate amet laborum. Sunt consectetur nulla nisi nisi irure magna veniam ut cupidatat minim."
  },
  {
    "commentId": 6857416881,
    "productId": 37,
    "userId": 2,
    "date": "2018-03-09",
    "ratingScore": 4,
    "commentText": "Tempor nulla mollit fugiat ullamco elit ad laborum irure eiusmod. Nostrud incididunt cupidatat eu incididunt sit incididunt voluptate ipsum nostrud et magna ex occaecat."
  },
  {
    "commentId": 7946308817,
    "productId": 34,
    "userId": 1,
    "date": "2018-04-21",
    "ratingScore": 4,
    "commentText": "Et deserunt commodo non cupidatat veniam elit cillum aliqua mollit amet eu amet pariatur non. In laboris exercitation duis velit laboris ex qui."
  },
  {
    "commentId": 5851305187,
    "productId": 22,
    "userId": 2,
    "date": "2019-09-24",
    "ratingScore": 3,
    "commentText": "Anim magna occaecat non nisi consequat cillum. Occaecat sint aliqua aliquip mollit reprehenderit duis laboris adipisicing."
  },
  {
    "commentId": 2664837198,
    "productId": 99,
    "userId": 3,
    "date": "2021-06-18",
    "ratingScore": 1,
    "commentText": "Est proident non ullamco proident mollit cupidatat eiusmod eiusmod occaecat. Non commodo magna in est elit laborum et tempor excepteur nostrud aliquip nostrud."
  },
  {
    "commentId": 2082211970,
    "productId": 98,
    "userId": 1,
    "date": "2019-08-31",
    "ratingScore": 2,
    "commentText": "Mollit ad fugiat proident qui. Cillum exercitation cupidatat irure magna."
  },
  {
    "commentId": 5991334260,
    "productId": 93,
    "userId": 1,
    "date": "2020-02-13",
    "ratingScore": 2,
    "commentText": "Dolor proident ea exercitation occaecat labore laboris esse consectetur amet dolor Lorem minim ullamco. Consequat dolore cillum cillum ea commodo amet velit est officia quis."
  },
  {
    "commentId": 1144482094,
    "productId": 40,
    "userId": 1,
    "date": "2020-08-19",
    "ratingScore": 4,
    "commentText": "Cillum nulla non anim in sunt ex incididunt labore ipsum. Voluptate sit nisi pariatur laborum sit nulla consectetur id aliquip qui pariatur labore exercitation laborum."
  },
  {
    "commentId": 1856703958,
    "productId": 90,
    "userId": 1,
    "date": "2018-08-22",
    "ratingScore": 2,
    "commentText": "Proident elit adipisicing dolor cupidatat. Sint labore ad nulla anim exercitation id pariatur ad dolore reprehenderit nostrud officia dolor esse."
  },
  {
    "commentId": 9932137562,
    "productId": 10,
    "userId": 2,
    "date": "2018-10-18",
    "ratingScore": 2,
    "commentText": "Id eiusmod voluptate laborum excepteur. Ut culpa ea minim officia voluptate ad duis et dolore ex dolor quis culpa quis."
  },
  {
    "commentId": 1343915989,
    "productId": 75,
    "userId": 2,
    "date": "2020-03-14",
    "ratingScore": 4,
    "commentText": "Anim reprehenderit officia deserunt laboris aliqua cillum anim qui amet aliqua quis velit adipisicing aliqua. Consectetur anim culpa reprehenderit reprehenderit cillum laboris."
  },
  {
    "commentId": 7807966057,
    "productId": 70,
    "userId": 1,
    "date": "2018-02-27",
    "ratingScore": 3,
    "commentText": "Exercitation aute fugiat quis velit amet aliqua officia mollit deserunt voluptate laborum exercitation non. Cupidatat nisi officia pariatur nisi non occaecat dolore cupidatat pariatur id aliquip ex deserunt eiusmod."
  },
  {
    "commentId": 9353571045,
    "productId": 7,
    "userId": 1,
    "date": "2021-08-18",
    "ratingScore": 5,
    "commentText": "Aliquip minim tempor dolore Lorem et laboris sint incididunt anim labore. Magna ex ad velit nostrud qui anim amet."
  }
]